Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of the Nāga King Anavatapta

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying at Vulture Peak Mountain near Rājagṛha with a great saṅgha of one thousand two hundred fifty monks and many bodhisattva great beings.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མས་བསྐོར་ནས་མདུན་གྱིས་བལྟས་ཏེ་ཆོས་སྟོན་ཏོ། །དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ། ཀླུའི་རྒྱལ་པོ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་དང་། ཀླུའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་སིལ་སྙན་དང་། གླུ་དབྱངས་ལེན་ཅིང་ཀླུའི་མཐུ་ཆེན་པོ་དང་།
en: At that time, while the Blessed One was teaching the Dharma to an audience of many hundreds of thousands, the nāga king Anavatapta, escorted by a retinue of six million eight hundred thousand nāga kings and eighty-four thousand nāga maidens playing instruments and singing songs, approached the Blessed One.

source: ཀླུའི་རྫུ་འཕྲུལ་ཆེན་པོས་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཐོགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་།
en: Through their great powers and miraculous abilities, those nāgas arrived bearing flowers, perfumes, incense, garlands, ointments, powders, garments, parasols, banners, and flags.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཇི་ལྟར་ཐོགས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: When they came before the Blessed One, they bowed their heads at the Blessed One’s feet, circumambulated the Blessed One three times, and offered the Blessed One all the flowers, perfumes, incense, garlands, ointments, powders, garments, parasols, banners, flags, instruments, and drums that they had brought.

source: བ་དན་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། གུས་པ་དང་བཅས། ཞེ་ས་དང་བཅས་ཤིང་རང་གི་སྐྱེ་བོའི་འཁོར་དང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Then, with respect and with reverence, the nāga king and his retinue of beings sat to one side.

source: འདུག་ནས་ཀྱང་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་དབྱེ་བར་གནང་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Once seated, the nāga king addressed the Blessed One with his palms joined together: “Were the Blessed One to grant me some time for instruction concerning my inquiries, there are some topics on which I would like to question the blessed, thus-gone, worthy, perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་བཞིན་དུ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ཁྱོད་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་དེ་བཞིན་གཤེགས་པ་ལ་ཅི་འདྲ་བ་ཞིག་ཡོངས་སུ་དྲི་བར་འདོད། གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གྱི་མཆོག །སེམས་ཅན་ཆེན་པོ། སྐྱེས་བུ་དམ་པ། སེང་གེ་ལྟར་རྣམ་པར་རྩེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་དེ་བཞིན་གཤེགས་པ་ལ་ཡོངས་སུ་ཞུ་བར་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཡོངས་སུ་འདྲེན་པ།
en: Although he already knew the answer, the Blessed One asked the nāga king Anavatapta, “Lord of nāgas, what is it that you would like to ask the Thus-Gone One for the sake of beings?”

source: འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མ་གོས་པ། སྤྱོད་པ་དང་བསམ་པ་རྣམ་པར་དག་པ། ཕན་པའི་དངོས་པོ་ལ་ཡང་དག་པར་ཞུགས་པ། གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་བགྱིད་པ། སྟོབས་བཅུའི་སྟོབས་ཀྱི་ཤུགས་ལ་ཡང་དག་པར་ཞུགས་པ། ངན་པའི་ཚོགས་ཅན་གྱི་ཚོགས་ཀྱི་སྨྲ་བ་ཡང་དག་པར་རབ་ཏུ་འཇོམས་པ། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ། སེམས་མ་ཞུམ་པ། བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆ་ཤིན་ཏུ་བགོས་པ། ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ། དགེ་བའི་རྩ་བའི་ཚོགས་དཔག་ཏུ་མ་མཆིས་པ་བསགས་པ། ཚུལ་ཁྲིམས་དང་ཐོས་པས་མི་ངོམས་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ། ཐ་དད་པའི་འདུ་ཤེས་དང་བྲལ་བ། མཐར་ལྟ་བ་གཉི་ག་དང་བྲལ་བ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པ་ཤེས་པ་ལ་མཁས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ཟབ་མོ་ལ་རབ་ཏུ་ཞུགས་པ། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བགྱིད་པ་དང་བྲལ་བ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་མ་བསྐྱུད་པ། བསམ་པ་རྡོ་རྗེ་ལྟར་བརྟན་ཏེ་མི་ཕྱེད་པ། བློ་ཟླ་བ་ལྟར་དྲི་མ་མ་མཆིས་ཤིང་ཤིན་ཏུ་དཀར་བ། སེམས་ནམ་མཁའི་དཀྱིལ་དང་མཚུངས་པ། བསྐལ་པ་གྲངས་མ་མཆིས་པར་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བར་འཛིན་པ། སེམས་ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་མཉམ་པ། གནོད་སེམས་དང་། ཐ་བ་དང་། ཞེ་སྡང་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: “Blessed One, I would like to question the Thus-Gone One on behalf of bodhisattvas, the supreme beings, the great beings, the holy ones who play like lions—on behalf, Blessed One, of the guides of the world who are untainted by worldly concerns; whose conduct and thoughts are pure; who bring genuine benefit to others; who act as spiritual friends to all beings without needing to be asked; who have the might of the ten powers; who defeat the arguments of those who attend misguided assemblies; who have overcome Māra and other opponents; who are undaunted; who have donned the armor of steadfast diligence; who are tireless of mind; who have accumulated immeasurable roots of virtue; whose appetite for discipline and learning cannot be satisfied; who treat all beings equally; who are devoid of the perception of difference; who are free from both extreme views; who are expert in understanding the processes of dependent origination; who engage with the profundity of the Buddha’s teachings that are deep and difficult to fathom; who are without the mental engagement of hearers and solitary buddhas; who have not forgotten the mind of omniscience; whose intention is as firm and unbreakable as a diamond; whose intelligence is as bright and unblemished as the moon; whose minds are like the expanse of space; who for countless eons have been indefatigable of mind; whose hearts are equal to earth, water, fire, and wind; who have eliminated malice, obstinacy, hatred, pride, arrogance, and conceit; who aspire to emptiness, signlessness, and wishlessness; who have comprehended that phenomena are like illusions, dreams, hallucinations, echoes, mirages, and reflections of the moon in water; who hold the lineage of the Buddha, the Dharma, and the Saṅgha; who are as rare as udumbara flowers; who delight in turning the wheel of the Dharma; who have obtained supreme joy and serenity; who are single-pointed in concentration with unwavering focus; who are endowed with all supreme attributes.

source: སྨོན་པ་མེད་པ་ལ་སྨོན་ལམ་ཤིན་ཏུ་བཏབ་པ། སྒྱུ་མ་དང་། རྨི་ལམ་དང་། མིག་ཡོར་དང་། བྲག་ཅ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་ལ་ཤིན་ཏུ་ཞུགས་པ། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་གདུང་རིགས་འཛིན་པ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་དང་དང་བ་རབ་ཏུ་ཐོབ་པ་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ལྟར་འབྱུང་བར་ཤིན་ཏུ་དཀའ་བ།
en: It is on behalf of such beings that I would like to question the Thus Gone One.

source: རྩེ་གཅིག་ཏུ་བགྱིད་པ་ཡིད་ལ་བགྱིད་པ་མ་འདྲེས་པ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཡོངས་སུ་ཞུ་བར་འཚལ་ལོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་ལ་རབ་ཏུ་ཞུགས་པ་རྣམས་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ཡོངས་སུ་ཞུ་བར་འཚལ་ན།
en: “Blessed One, it is for the sake of bodhisattva great beings whose noble qualities surpass even these, and for the sake of all beings, that I make these inquiries of the Thus Gone One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཆོས་ཀྱིས་རྣམ་པར་རྩེན་པ། རྡོ་རྗེ་ལྟ་བུའི་ཡོན་ཏན་ལ་འཇུག་པ། སྤྱོད་པ་ཟབ་མོ་དང་གཟུངས་ཀྱི་སྒོའི་དཀྱིལ་འཁོར་ལ་འཇུག་པ་བཤད་དུ་གསོལ།
en: “Blessed One, for bodhisattva great beings, please explain the play of phenomena, entering vajra-like qualities, and entering profound practice and the arrangement of dhāraṇī gateways.

source: ཉན་ཐོས་གདུལ་བའི་སླད་དུ་བདེན་པ་བཞི་རྣམ་པར་གདོན་མི་འཚལ་བ་ལ་འཇུག་པ། ཤེས་པའི་སྒོ་ལ་འཇུག་པ།
en: So as to train hearers, please explain entering the gateway of knowledge through sure engagement with the four truths of the noble ones.

source: རང་སངས་རྒྱས་གདུལ་བའི་སླད་དུ་བརྟེན་པའི་ཆོས་ལ་འཇུག་པ། ཤེས་པའི་སྒོ་ལ་འཇུག་པ།
en: So as to train solitary buddhas, please explain entering the gateway of knowledge through engagement with teachings on dependence.

source: ཐེག་པ་ཆེན་པོ་པ་གདུལ་བའི་སླད་དུ་ཆོས་ཐམས་ཅད་ལ་འཇུག་པ་ཤེས་པའི་སྒོ་ལ་འཇུག་པ། བདུད་ཀྱི་ཕྱོགས་ཚར་གཅོད་པ། ལྟ་བར་གྱུར་པ་ཐམས་ཅད་རྣམ་པར་འཇིག་པ་ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བ།
en: So as to train those of the Great Vehicle, please explain entering the gateway of knowledge through engagement with all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་པ། སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ། ཆོས་ཐམས་ཅད་རབ་ཏུ་སྟོན་པ། ཇི་ལྟར་མོས་པ་བཞིན་ཆོས་ལས་རྣམ་པར་གྲོལ་བར་བགྱིད་པ་དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕན་གདགས་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བཤད་དུ་གསོལ།
en: “Blessed, thus-gone, worthy, perfect Buddha, for the benefit of bodhisattvas, please tell us about the annihilation of the hordes of Māra, the destruction of all wrong views, the elimination of all afflictions, the knowledge of all beings’ actions, the engagement of correct understandings, the thorough explanation of all teachings, and the way beings are liberated in accordance with their inclinations.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་དྲེགས་པ་བཅོམ་པས་ཡེ་ཤེས་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: “Blessed One, how are bodhisattvas endowed with the power of wisdom through conquering pride, arrogance, and conceit?

source: ཇི་ལྟར་ན་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པས་ཆོས་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of Dharma through reliance on the ripening of karma?

source: ཇི་ལྟར་ན་འཇིག་རྟེན་གྱི་ཟང་ཟིང་དང་ཆོས་ཀྱི་སྦྱིན་པ་ལ་སེར་སྣ་མ་མཆིས་པས་སྦྱིན་པའི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of generosity through not being miserly with material goods or with the gift of the Dharma?

source: ཇི་ལྟར་ན་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་རྣམས་ལགས།
en: How are they ready to give up everything without expecting reward?

source: ཇི་ལྟར་ན་སྨོན་ལམ་གྱིས་ཡང་དག་པར་སོང་ཞིང་ངན་སོང་ཐམས་ཅད་ཀུན་ཏུ་ཆད་པས་ཚུལ་ཁྲིམས་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of discipline through behaving correctly in accordance with their aspirations and cutting off all entrances to the lower realms?

source: ཇི་ལྟར་ན་སེམས་ཅན་སྡང་བ་ཐམས་ཅད་དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་པས་བཟོད་པའི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of patience through having the nature of being able to accept all the hostility of beings?

source: ཇི་ལྟར་ན་ལུས་དང་སྲོག་ལ་མི་ལྟ་བས་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of diligence through having no regard for their own lives and limbs?

source: ཇི་ལྟར་ན་རབ་ཏུ་ཞི་བ་ལ་གནས་ཤིང་བསམ་གཏན་ལས་ལྡོག་པ་ཡང་མཁས་པས། བསམ་གཏན་གྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of concentration by abiding in tranquility and knowing how to emerge out of concentration?

source: ཇི་ལྟར་ན་སྡིག་པའི་ལྟ་བ་རྣམས་དང་བྲལ་ཞིང་མ་རིག་པ་དང་གཏི་མུག་གི་མུན་པ་དང་བྲལ་བས་ཤེས་རབ་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of insight by being devoid of negative views and the darkness of ignorance and delusion?

source: ཇི་ལྟར་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་ལ་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་གོ་ཆ་འཚལ་བས་ཐབས་ཀྱི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of skillful means by ripening beings and seeking the armor by which they ripen them?

source: ཇི་ལྟར་ན་ལྷའི་མིག་དང་ལྷའི་རྣ་བ་དང་ཕ་རོལ་གྱི་སེམས་འཚལ་བ་དང་། སྔོན་གྱི་སྐྱེ་བ་དང་། རྫུ་འཕྲུལ་གྱི་བགྱི་བས་རྣམ་པར་རྩེན་པས་མངོན་པར་ཤེས་པ་ཐོབ་པ་རྣམས་ལགས།
en: How have they obtained the higher perceptions by reveling in the divine eye, the divine ear, the knowledge of the thoughts of others, the knowledge of previous births, and miraculous powers?

source: ཇི་ལྟར་ན་སྤོབས་པ་རྒྱུན་མི་འཆད་ཅིང་ཚིག་དང་ཡི་གེ་མི་ཟད་པས་སྤོབས་པའི་སྟོབས་ཅན་རྣམས་ལགས།
en: How are they endowed with the power of eloquence by means of uninterrupted eloquence with inexhaustible words and syllables?

source: ཇི་ལྟར་ན་ཐོས་པ་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པས་གཟུངས་ཐོབ་པ་རྣམས་ལགས།
en: How do they attain the power of retention that retains all that has been heard?

source: ཇི་ལྟར་ན་ཆོས་དཀོན་མཆོག་གཅིག་ལ་ཡང་དག་པར་གཞོལ་བར་བསྐྱུད་པ་མ་མཆིས་པ་དང་། རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ་རྣམས་ལགས།
en: How do they attain the absorption called the ocean seal and maintain unfaltering focus on the unique precious jewel of Dharma?

source: ཇི་ལྟར་ན་སངས་རྒྱས་ལ་ལྟ་བ་རྣམ་པར་དག་པ་ལ་ཡང་དག་པར་གཞོལ་བས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྐྱུད་པ་མ་མཆིས་པ་རྣམས་ལགས།
en: How do they maintain the unfaltering mindfulness of the Buddha that stays focused on the pure view of the Buddha?

source: ཆོས་ལ་ལྟ་བ་རྣམ་པར་དག་པ་ལ་ཡང་དག་པར་གཞོལ་བས་ཆོས་རྗེས་སུ་དྲན་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ལགས།
en: How do they achieve the mindfulness of the Dharma that stays focused on the pure view of the Dharma?

source: ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་ལ་ཡང་དག་པར་གཞོལ་བས་དགེ་འདུན་རྗེས་སུ་དྲན་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ལགས།
en: How do they achieve the mindfulness of the Saṅgha that stays focused on the saṅgha of those who have reached irreversibility?

source: བྱང་ཆུབ་ཀྱི་སེམས་མ་བསྐྱུད་པས་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ལགས།
en: How do they achieve the mindfulness of discipline in which the mind of awakening does not falter?

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་དང་ཆོས་ཀྱི་སྦྱིན་པ་ལ་སེར་སྣ་མ་མཆིས་པས་གཏོང་བ་རྗེས་སུ་དྲན་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ལགས།
en: How do they achieve the mindfulness of generosity that is not miserly with regard to material things and the gift of the Dharma?

source: དགའ་ལྡན་གྱི་གནས་སུ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྗེས་སུ་དྲན་པས་ལྷ་རྗེས་སུ་དྲན་པ་བསྐྱུད་པ་མ་མཆིས་པ་རྣམས་ལགས།
en: How do they maintain the unfaltering mindfulness of the gods that recollects those bodhisattvas in the Heaven of Joy who are bound by just one last birth?”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བཅོམ་ལྡན་འདས་ལ་ཞུ་བ་འདི་དག་ཞུས་ནས་དེའི་འོག་ཏུ་ཚིགས་སུ་བཅད་དེ་ཞུས་པ། འཇིག་རྟེན་དོན་རྣམས་མཛད་པར་རང་བྱུང་བ། །ལྷག་པའི་བསམ་དང་བསམ་པ་ཅི་འདྲ་དང་། །
en: Having asked these questions of the Blessed One, the nāga king Anavatapta spoke the following verses: “Self-arisen one who serves the needs of the world, What should our determination and our intention be like?

source: འཇུག་པའི་སྤྱོད་དང་སྤྱོད་པ་ཅི་འདྲ་བ། །
en: What should our conduct and behavior be like?

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བཤད་དུ་གསོལ། །
en: Please instruct the bodhisattvas.

source: བྱམས་པར་སྦྱོར་དང་སྙིང་རྗེར་འཇུག་པ་དང་། །དགའ་ལ་འཇུག་ཅིང་བཏང་སྙོམས་སྒོམ་པ་དང་། །བསམ་གཏན་རྣམ་ཐར་རྣམས་ལ་སྦྱོར་དག་པ། །དེ་ནི་མ་སྨད་བདག་ལ་བཤད་དུ་གསོལ། །
en: “Enjoining love, engaging compassion, Feeling joy, cultivating equanimity, Practicing the liberative absorptions— Please explain these to me and my family!

source: ཡང་དག་སྤོང་དང་དྲན་པ་ཉེར་གཞག་དང་། །རྫུ་འཕྲུལ་སྟོབས་དང་དབང་པོ་ལམ་སྒོམ་དང་། །བྱང་ཆུབ་ཡན་ལག་བདེན་དང་ཡང་དག་རིག །ཡོན་ཏན་འབྱུང་གནས་རྣམས་ལ་བཤད་དུ་གསོལ། །
en: “Cultivating the path of the correct exertions, the applications of mindfulness, The bases of miraculous power, the powers, and the strengths And understanding the truths and the branches of awakening— Please explain these topics to these fonts of good qualities!

source: སྦྱིན་དུལ་སྡོམ་དང་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས། །བཟོད་དང་དེས་དང་དེ་བཞིན་བརྩོན་འགྲུས་དང་། །ཤེས་རབ་ཐོབ་པས་རབ་ཏུ་རྟོགས་པ་རྣམས། །ཇི་ལྟར་འགྱུར་དེ་དེ་དག་བཤད་དུ་གསོལ། །
en: “Abundant generosity, self-control, and discipline, Patience, gentleness, and diligence, Realization through the attainment of insight— Please tell us how these come about!

source: མངོན་ཤེས་རིག་དང་སོ་སོ་ཡང་དག་རིག །དྲན་དང་ཤེས་བཞིན་དེ་བཞིན་བག་ཡོད་དང་། །ཐབས་དང་ལྡན་དང་ཚུལ་ནི་རྟོགས་པ་རྣམས། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་དེ་བཤད་གསོལ། །
en: “The higher perceptions, awareness, and correct understandings, Mindfulness, alertness, and heedfulness, Skillful means and the realization of the proper way— Please explain these to the bodhisattvas!

source: དགའ་དང་མཆོག་ཏུ་དགའ་དང་ཡོན་ཏན་དགའ། །འཕགས་པའི་སྦྱངས་དང་རིགས་དང་ནོར་བདུན་དང་། །དགོན་པར་གནས་ཤིང་ཉོན་མོངས་མ་མཆིས་གནས། །ཇི་ལྟར་འགྱུར་དེ་དེ་དག་བཤད་དུ་གསོལ། །
en: “Joy, supreme joy, rejoicing in qualities, The purity, lineage, and seven treasures of the noble ones, And staying in solitude without afflictions— Please tell us how these come about!

source: ཇི་ལྟར་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་། །གཟུངས་ལའང་ཤིན་ཏུ་རབ་ཏུ་གནས་པ་དང་། །
en: “How do we achieve excellent eloquence While maintaining perfect retention?

source: རྒྱུན་མི་འཆད་པར་ཆོས་ནི་སྟོན་པ་དང་། །བསྐྱུད་པ་མ་མཆིས་ཐོས་པ་འཛིན་པར་འགྱུར། །
en: How do we teach the Dharma without interruption While not forgetting what we have learned?

source: ཞི་གནས་རྗེས་སུ་འཐུན་དང་ལྷག་མཐོང་དང་། །ཤེས་རབ་ཟབ་དང་ཤིན་ཏུ་བློ་ཡངས་དང་། །ཡེ་ཤེས་མཐའ་ཡས་རྟོགས་པ་མཉམ་མེད་དུ། །བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ཇི་ལྟར་འགྱུར། །བདུད་ཀྱི་སྟོབས་བཅོམ་ཤིན་ཏུ་ཐུལ་བར་དཀའ། །ངན་པའི་ཚོགས་ཅན་ཕ་རོལ་སྨྲ་བ་འཇོམས། །
en: “How do bodhisattvas master Harmoniously combining tranquility and special insight, Profound insight and mental spaciousness, Limitless wisdom, and unequaled realization?

source: རི་རབ་འདྲ་བར་མི་གཡོ་ཤིན་ཏུ་འཕགས། །དག་པའི་སེམས་ཅན་ཟླ་བ་ལྟ་བུར་སྤྱོད། །སྟོང་པ་མཚན་མེད་སྨོན་མེད་རྣམ་གྲོལ་དང་། །སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུར་ཆོས་ངེས་དང་། །འདུས་བྱས་རྨི་ལམ་ངོ་བོ་ཉིད་མོས་པ། །
en: “Overcoming the power of Māra, being difficult to subdue, Defeating enemies and opponents, Being immovable and lofty like Mount Sumeru, Acting with a mind as pure as the moon, “Emptiness, signlessness, wishlessness, and liberation, Certainty that phenomena are like illusions or mirages, And conviction in the dream-like nature of compounded phenomena— Please explain these to me and my family!”

source: དེ་ནི་མ་སྨད་བདག་ལ་བཤད་དུ་གསོལ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One replied to the nāga king Anavatapta, “Excellent, lord of nāgas!

source: ཀླུའི་བདག་པོ་ཁྱོད་ཇི་ལྟར་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུ་འཐུན་པ་དང་།
en: Excellent! That you have thought to ask the Thus-Gone One these questions is in keeping, lord of the nāgas, with your previous roots of virtue.

source: སྙིང་རྗེ་ཆེན་པོ་མ་བཏང་བ་དང་། གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་བྱེད་པ་དང་། འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་གྱི་རིགས་རྒྱུན་མི་གཅོད་པས་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་ཡང་ལེགས་སོ། །
en: You have not given up great compassion, you act as a spiritual friend to all beings without being asked, you are not disheartened in saṃsāra, and you perpetuate the lineage of the Buddha, the Dharma, and the Saṅgha—excellent!

source: ཀླུའི་བདག་པོ་དེའི་ཕྱིར་ལེགས་པར་ཤིན་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་འདི་དག་དང་། ཡོན་ཏན་གྱི་ཁྱད་པར་གཞན་དག་ཀྱང་ཐོབ་པར་འགྱུར་བ་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Therefore, lord of nāgas, listen carefully, and pay attention; I shall tell you how bodhisattvas attain these and other distinguished qualities.”

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “I will, Blessed One,” replied the nāga king Anavatapta, and he listened as the Blessed One had instructed.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གཅིག་དང་ལྡན་ན་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འཛིན་ཏོ། །
en: “Lord of nāgas,” said the Blessed One, “if bodhisattva great beings have just one quality, they will have all the qualities of a buddha with every supreme attribute.

source: ཆོས་གཅིག་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is that single quality?

source: སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བའི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་སོ། །
en: It is the mind of omniscience that does not overlook any being.

source: དེའི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ཡང་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ཤིན་ཏུ་བསྡུས་པ་ཡིན་ཏེ།
en: This mind of omniscience involves thirty-two aspects.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན་འདི་ལྟ་སྟེ། བསམ་པས་བསྡུས་པ་ཡིན། ལྷག་པའི་བསམ་པས་བསྡུས་པ་ཡིན། བྱམས་པ་ཆེན་པོས་བསྡུས་པ་ཡིན། སྙིང་རྗེ་ཆེན་པོས་བསྡུས་པ་ཡིན། ཡོངས་སུ་མི་སྐྱོ་བས་བསྡུས་པ་ཡིན། སྟོབས་ཀྱིས་བསྡུས་པ་ཡིན། རྣམ་པར་གནོན་པས་བསྡུས་པ་ཡིན། མཐུས་བསྡུས་པ་ཡིན། སོ་སོར་བརྟགས་པས་བསྡུས་པ་ཡིན། དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྡུས་པ་ཡིན། ཆོས་སྤྱོད་པས་བསྡུས་པ་ཡིན། དགེ་བ་སྤྱོད་པས་བསྡུས་པ་ཡིན། བསྡུ་བའི་དངོས་པོས་བསྡུས་པ་ཡིན། སྡོམ་པས་བསྡུས་པ་ཡིན། ཐབས་ཀྱིས་བསྡུས་པ་ཡིན། བཅོས་མ་མ་ཡིན་པས་བསྡུས་པ་ཡིན། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པས་བསྡུས་པ་ཡིན། ཕྱིར་བྱ་བའི་རེ་བ་མེད་པས་བསྡུས་པ་ཡིན། ངོ་ཚ་ཤེས་པས་བསྡུས་པ་ཡིན། ཁྲེལ་ཡོད་པས་བསྡུས་པ་ཡིན།
en: What are the thirty-two aspects?

source: མཆོག་ཏུ་དགའ་བས་བསྡུས་པ་ཡིན། དད་པས་བསྡུས་པ་ཡིན། བརྩོན་འགྲུས་ཀྱིས་བསྡུས་པ་ཡིན། དྲན་པས་བསྡུས་པ་ཡིན། ཏིང་ངེ་འཛིན་གྱིས་བསྡུས་པ་ཡིན། ཤེས་རབ་ཀྱིས་བསྡུས་པ་ཡིན། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་བསྡུས་པ་ཡིན། ཐེག་པ་དམན་པ་ལ་འདོད་པ་མེད་པས་བསྡུས་པ་ཡིན། རྒྱ་ཆེན་པོ་ལ་མོས་པས་བསྡུས་པ་ཡིན། སེམས་ཅན་ལ་ལྟ་བས་བསྡུས་པ་ཡིན།
en: It involves intention, it involves resolve, it involves great love, it involves great compassion, it involves tirelessness, it involves strength, it involves overcoming, it involves power, it involves discernment, it involves giving spiritual guidance, it involves Dharma practice, it involves virtuous behavior, it involves the means of attraction, it involves restraint, it involves skillful means, it involves nonfabrication, it involves following through on one’s words, it involves not hoping for reward, it involves modesty, it involves humility, it involves joy, it involves faith, it involves diligence, it involves mindfulness, it involves absorption, it involves insight, it involves roots of virtue, it involves disinterest in the lower vehicles, it involves dedication to the vast, it involves concern for beings, and it involves perpetuating of the lineage of the Buddha, the Dharma, and the Saṅgha.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་རིགས་མི་གཅོད་པས་བསྡུས་པ་ཡིན་ཏེ། ཀླུའི་བདག་པོ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་གིས་བསྡུས་ན་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འཛིན་ཏོ། །
en: Lord of nāgas, when the mind of omniscience embraces these thirty-two aspects, one will have all the qualities of a buddha endowed with every supreme attribute.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དེ་ཚོགས་བསགས་པ་རྣམ་པ་བཅུ་དྲུག་གིས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འགྲོ་བར་འགྱུར་ཏེ།
en: “Furthermore, lord of nāgas, the mind of omniscience relates to the wisdom of omniscience in terms of sixteen accumulations.

source: བཅུ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་བསགས་པ་ཡིན། ཐོས་པའི་ཚོགས་བསགས་པ་ཡིན། ཤེས་རབ་ཀྱི་ཚོགས་བསགས་པ་ཡིན། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བའི་ཚོགས་བསགས་པ་ཡིན། དགོན་པ་ལ་གནས་པའི་ཚོགས་བསགས་པ་ཡིན། ཇི་ལྟར་ཐོས་པའི་ཆོས་སྟོན་པའི་ཚོགས་བསགས་པ་ཡིན།
en: What are the sixteen?

source: ཚངས་པའི་གནས་པ་བཞིའི་ཚོགས་བསགས་པ་ཡིན། དགའ་བར་འགྱུར་བའི་ཆོས་ཀྱི་ཚོགས་བསགས་པ་ཡིན། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་ཚོགས་བསགས་པ་ཡིན། ལུས་དང་ངག་དང་སེམས་ཀྱི་རྒྱན་གྱི་ཚོགས་བསགས་པ་ཡིན། སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པའི་ཚོགས་བསགས་པ་ཡིན། འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་རབ་ཏུ་དབེན་པའི་ཚོགས་བསགས་པ་ཡིན། ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ཡོངས་སུ་བསྔོ་བའི་ཚོགས་བསགས་པ་ཡིན། ཞི་གནས་ཀྱི་ཚོགས་བསགས་པ་ཡིན།
en: They are the accumulations of discipline, of learning, and of insight; the accumulations of worshiping and serving the Thus-Gone One, of staying in solitude, and of teaching the Dharma just as one has heard it; the accumulations of the four abodes of Brahmā, of pleasing qualities, and of the path of the ten virtues; the accumulation of the ornaments of body, speech, and mind; the accumulation of ascetic practices and austerity; the accumulations of having few desires, of contentment, and of complete seclusion; the accumulation of dedication as formulated in the three sections; the accumulation of tranquility; the accumulation of special insight; and the accumulation of all roots of virtue.
